Delans-TLE/src/InformationRegisters/ES_СтартовыеНастройки/ES_СтартовыеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_СтартовыеНастройки</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>EnumRef.ES_ДниДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>EnumRef.ES_ВидыЗабора</types>
      <types>Boolean</types>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      <types>EnumRef.ES_ТипПодключения</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Ячейки</types>
      <types>EnumRef.ES_ТипыПлательщиков</types>
      <types>EnumRef.ТипыДенежныхСредств</types>
      <types>CatalogRef.Организации</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>EnumRef.ES_СистемыОпределенияКоординат</types>
      <types>EnumRef.ES_ВидыДоставки</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСтартовойНастройки</name>
    <type>
      <types>EnumRef.ES_ВидыСтартовыхНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Enums/ES_ВидыСтартовыхНастроек/ES_ВидыСтартовыхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыСтартовыхНастроек</name>
  <enumValues>
    <name>ВидЗабора</name>
  </enumValues>
  <enumValues>
    <name>ВидОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДеньДоставки</name>
  </enumValues>
  <enumValues>
    <name>ДопКассаНП</name>
  </enumValues>
  <enumValues>
    <name>КассаНаложенныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойГород</name>
  </enumValues>
  <enumValues>
    <name>Плательщик</name>
  </enumValues>
  <enumValues>
    <name>РозничныйПокупатель</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисЛогин</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисПароль</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисСервер</name>
  </enumValues>
  <enumValues>
    <name>УслугаДоставки</name>
  </enumValues>
  <enumValues>
    <name>УслугаРКО</name>
  </enumValues>
  <enumValues>
    <name>УслугаСамовывоза</name>
  </enumValues>
  <enumValues>
    <name>УслугаСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Характеристика</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьГрузы</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьЗабор</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка1Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка2Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка3Цвет</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВремяНаКарте</name>
  </enumValues>
  <enumValues>
    <name>СистемаОпределенияКоординат</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Коэффициент</name>
    <comment>Коэффициент расчета объемного веса</comment>
  </enumValues>
  <enumValues>
    <name>ES_Переключатель</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPСервер</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPПорт</name>
  </enumValues>
  <enumValues>
    <name>ES_Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ES_Пароль</name>
  </enumValues>
  <enumValues>
    <name>ES_Каталог</name>
  </enumValues>
  <enumValues>
    <name>ПоискЗаказовПоВхНакладной</name>
    <comment>Истина - При поиске по штрихкоду заказы подбираются по Вх накладной,  Ложь - По НомеруНакладной</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПринятКурьером</name>
    <comment>При создании плана заказам автоматически присваивается статус &quot;Принят курьером&quot;</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПриемЗаборов</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДляГрузов</name>
  </enumValues>
  <enumValues>
    <name>Метка1Код</name>
  </enumValues>
  <enumValues>
    <name>Метка2Код</name>
  </enumValues>
  <enumValues>
    <name>Метка3Код</name>
  </enumValues>
  <enumValues>
    <name>КодСкладДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвериУпрощенный</name>
  </enumValues>
  <enumValues>
    <name>КодСамовывоз</name>
  </enumValues>
  <enumValues>
    <name>КодДвериТерминал</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалТерминал</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураДляЧека</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНоменклатуруДляЧеков</name>
  </enumValues>
  <enumValues>
    <name>ВидДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьДДуНаКарте</name>
  </enumValues>
  <enumValues>
    <name>УслугаСбора</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаОсновная</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаПроблема</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалПВЗ</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляСбора</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ТокенБотаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ИДЧатаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляВидаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЛогинПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>ПарольПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>АдресСклада</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаДолгота</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаШирота</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/CommonModules/EFSOL_ОбменМобильноеПриложениеОбщее/Module.bsl
// Процедура вносит в информационную базу данные, которые присланы из узла УзелОбмена 
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение",с которым осуществляется обмен 
//  ДанныеОбмена - пакет обмена полученный из узла УзелОбмена, помещенный в ХранилищеЗначения
//  ОчиститьИзменения - параметр определяет, нужно ли очищать ранее отправленные изменения
//
Процедура ПринятьПакетОбмена(УзелОбмена, ДанныеОбмена = Ложь, ОчиститьИзменения = Ложь) Экспорт
	МассивНастроек = ПолучитьСтартовыеНастройки();
	 
	ЧтениеXML = Новый ЧтениеXML;
	
	Если МассивНастроек[0] = "FTP" Тогда
		FTPСоединение = Новый FTPСоединение(СокрЛП(МассивНастроек[1]), ?(Число(МассивНастроек[2]) = 0, Неопределено, МассивНастроек[2]),
													СокрЛП(МассивНастроек[3]),МассивНастроек[4],,Истина,,);
		
		Каталог = СокрЛП(МассивНастроек[5]) + "out/";
		FTPСоединение.УстановитьТекущийКаталог(Каталог);
		
		МассивФайлов = FTPСоединение.НайтиФайлы(Каталог, "*.xml", Истина);
		ИмяФайлаНаFTP  = "message01_" + УзелОбмена.Префикс + ".xml";
		
		Если МассивФайлов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Элемент Из МассивФайлов Цикл
			Если ИмяФайлаНаFTP = Элемент.Имя Тогда
				
				ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");	
				FTPСоединение.Получить(ИмяФайлаНаFTP, ВременныйФайл);
				
				Попытка
					ЧтениеXML.ОткрытьФайл(ВременныйФайл);
				Исключение
					Сообщить("ошибка чтения файла");	
				КонецПопытки;
				
				ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
				ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
				
				Если ОчиститьИзменения Тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
				КонецЕсли;
				
				ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	
				Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
				EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
				
			КонецЕсли;
			
		КонецЦикла;
		
		//ИмяФайлаНаFTP  = "message01_" + УзелОбмена.Префикс + ".xml";
		//ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
		//
		//FTPСоединение.Получить(ИмяФайлаНаFTP, ВременныйФайл);

		
		//ИмяФайла = "E:\Файлы\Коваленко\Логсервис\ftp_обмен\out\messageOS_ЦБ.xml";
		//Попытка
		//	ЧтениеXML.ОткрытьФайл(ВременныйФайл);
		//Исключение
		//	Сообщить("ошибка чтения файла");	
		//КонецПопытки;
		
	Иначе
		ЧтениеXML.УстановитьСтроку(ДанныеОбмена.Получить());
		
		ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
		
		Если ОчиститьИзменения Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
		КонецЕсли;
		
		ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	
		Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	
		EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
		
	КонецЕсли;
	
	//ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	//ЧтениеСообщения.НачатьЧтение(ЧтениеXML, ДопустимыйНомерСообщения.Любой);
		
	//проверить это условие
	//Если ОчиститьИзменения Тогда
	//	ПланыОбмена.УдалитьРегистрациюИзменений(ЧтениеСообщения.Отправитель, ЧтениеСообщения.НомерПринятого);
	//КонецЕсли;
		
	//ТипОбъектаXDTO = ФабрикаXDTO.Тип("EFSOL_DeliveryServiceUT", "Objects");
	//
	//Объекты = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML, ТипОбъектаXDTO);
	//
	//EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗагрузитьОбъекты(УзелОбмена, Объекты);
	
	Если Не ЧтениеСообщения = Неопределено Тогда
		ЧтениеСообщения.ЗакончитьЧтение();
	КонецЕсли;
	
	ЧтениеXML.Закрыть();
	
	Если МассивНастроек[0] = "FTP" Тогда
		Попытка
			FTPСоединение.Удалить(ИмяФайлаНаFTP);
		Исключение
			
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ПринятьПакетОбмена()

// Функция формирует пакет обмена, который будет отправлен узлу УзелОбмена
//
// Параметры:
//  УзелОбмена	– узел плана обмена "МобильноеПриложение", с которым осуществляется обмен
//
// Возвращаемое значение:
//  сформированный пакет, помещенный в хранилище значения
Функция СформироватьПакетОбмена(УзелОбмена, КодМобильногоКомпьютера) Экспорт
	МассивНастроек = ПолучитьСтартовыеНастройки();
	
	ПользовательМобильногоУстройства = ПланыОбмена.EFSOL_МобильноеПриложение.НайтиПоКоду(КодМобильногоКомпьютера).Пользователь;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если Ложь Тогда
		FTPСоединение = Новый FTPСоединение(СокрЛП(МассивНастроек[1]), ?(Число(МассивНастроек[2]) = 0, Неопределено, МассивНастроек[2]),
													СокрЛП(МассивНастроек[3]),МассивНастроек[4],,Истина,,);
		
		Каталог = СокрЛП(МассивНастроек[5]) + "in/";
		FTPСоединение.УстановитьТекущийКаталог(Каталог);	
		ИмяФайлаНаFTP  = "message" + УзелОбмена.Префикс + "_01.xml";		
		ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");

		ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Истина);
		ЗаписьXML.ОткрытьФайл(ВременныйФайл, ПараметрыЗаписиXML);
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;
	
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
		
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, УзелОбмена);
		
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("v8",  "http://v8.1c.ru/data");
	
	//ES_Коваленко М.{ //при первой синхронизации
	Если УзелОбмена.НомерОтправленного = 0 И УзелОбмена.НомерПринятого = 0 Тогда
		ВыборкаИзменений = ПолучитьОтчетыОДоставке(ПользовательМобильногоУстройства);
		ПерваяСинхронизация = Истина;
	Иначе
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, ЗаписьСообщения.НомерСообщения);
		ПерваяСинхронизация = Ложь;
	КонецЕсли;	
	// } ES_Коваленко
		
	ВозвращаемыйСписок = EFSOL_ОбменМобильноеПриложениеПереопределяемый.СоздатьОбъектXDTO("Objects");
	
	Пока ВыборкаИзменений.Следующий() Цикл
		Если ПерваяСинхронизация Тогда
			Данные = ВыборкаИзменений.Ссылка;
		Иначе	
			Данные = ВыборкаИзменений.Получить();
		КонецЕсли;
		
		//учитываем только документы ОтчетОДоставке, спр. пользователи передавать не будем	
		
		Если НЕ ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
			Если Данные.Курьер.Пустая() Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Данные);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если (ТипЗнч(Данные) = Тип("УдалениеОбъекта")) 
			ИЛИ (Данные.Курьер = ПользовательМобильногоУстройства И Данные.Проведен) Тогда //И НЕ Данные.ES_ЗакрытКурьером) Тогда
			EFSOL_ОбменМобильноеПриложениеПереопределяемый.ЗаписатьДанные(ВозвращаемыйСписок, Данные);
		Иначе
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Данные);
		КонецЕсли;
		
	КонецЦикла;
	
	
	Если Ложь Тогда
	
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
		ЗаписьСообщения.ЗакончитьЗапись();
		
		ЗаписьXML.Закрыть();
		FTPСоединение.Записать(ВременныйФайл, ИмяФайлаНаFTP);
		Возврат Новый ХранилищеЗначения("success", Новый СжатиеДанных(9));
	Иначе
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
		ЗаписьСообщения.ЗакончитьЗапись();
		Возврат Новый ХранилищеЗначения(ЗаписьXML.Закрыть(), Новый СжатиеДанных(9));
		
	КонецЕсли;
			
КонецФункции // СформироватьПакетОбмена()

Функция ПолучитьОтчетыОДоставке(ПользовательМобильного)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ES_ОтчетОДоставке.Ссылка
	               |ИЗ
	               |	Документ.ES_ОтчетОДоставке КАК ES_ОтчетОДоставке
	               |ГДЕ
	               |	ES_ОтчетОДоставке.Курьер = &ПользовательМобильногоУстройства
	               |	И ES_ОтчетОДоставке.Дата >= &Дата";
	//ПользовательМобильного = Справочники.Сотрудники.НайтиПоНаименованию(ПользовательМобильногоУстройства);
	Если ПользовательМобильного = Неопределено Тогда
		ПользовательМобильного = Справочники.Сотрудники.ПустаяСсылка();	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПользовательМобильногоУстройства",ПользовательМобильного);
	Запрос.УстановитьПараметр("Дата",НачалоНедели(ТекущаяДата()));
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
КонецФункции

Функция ПолучитьСтартовыеНастройки()
	Запрос = Новый Запрос();
	МассивНастроек = Новый Массив();
	
	Запрос.Текст = "ВЫБРАТЬ
		|	""ES_Переключатель"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь = &Пользователь
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Переключатель)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_FTPСервер"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_FTPСервер)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ES_СтартовыеНастройки.Значение,
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_FTPПорт)
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Пользователь"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Пользователь)
		|
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Пароль"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Пароль)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ES_Каталог"",
		|	ES_СтартовыеНастройки.Значение
		|ИЗ
		|	РегистрСведений.ES_СтартовыеНастройки КАК ES_СтартовыеНастройки
		|ГДЕ
		|	ES_СтартовыеНастройки.Пользователь В(&Пользователь)
		|	И ES_СтартовыеНастройки.ВидСтартовойНастройки = ЗНАЧЕНИЕ(Перечисление.ES_ВидыСтартовыхНастроек.ES_Каталог)";
		
	Запрос.УстановитьПараметр("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	
	//КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНастроек.Добавить(Выборка.Значение);	
	КонецЦикла;
		
	Возврат МассивНастроек;
КонецФункции
